---
layout: post
title:  "[python] 1. 파이썬 기초 - 변수와 자료형"
date:   2024-10-07 00:00:00 +0900
categories: dev develop
---
이번에는 파이썬 기초 문법인 변수와 자료형에 대해 알아보자 

* toc
{:toc}

<br>
<br>
<br>

---
## **파이썬 자료형**

### **자료형이란**
* 

<br>

### **파이썬 자료형의 종류**     
> `숫자` `문자열` `리스트` `딕셔너리` `튜플` `집합` `불`
<br>

**1) 숫자형 자료형**     
> 숫자형 자료형에는 `정수형` `실수형` `8진수와 16진수` 가 있다
<br>

* 정수형(integer) : 정수를 뜻하는 자료형  `ex) 1, 0, -1123`
```
i1 = 1
i2 = 0
i3 = -1123
```

* 실수형(floating-point)
  * 소수점이 포함된 자료형  `ex) 3.14, -0.0003`
  * 컴퓨터식 지수표현 방식  `ex) 4.24e10 또는 4.24E10`
```
f1 = 3.141592
f2 = 0.00
f3 = -0.00003
f4 = 4.24E10      # 4.24 * 10^10
f5 = 4.24e-10      # 4.24 * 10^(-10)
```

* 8진수와 16진수 
  * 8진수(octal)를 만들기 위해서는 숫자가 `0o 또는 0O(숫자 0 + 알파벳 소문자 o 또는 대문자 O)으로 시작`
  * 16진수(hexadecimal)를 만들기 위해서는 0x로 시작
```
octal1 = 0o177
octal2 = 0O177
hex1 = 0xABC

print(octal1, octal2, hex1)    # result : 127, 127, 2748
```


**2) 문자열 자료형**
* 여러개의 문장을 묶은 것
* `{} 중괄호(curly brace)`로 묶음
* 들여쓰기(indetation): `tab키`를 사용해 블록 내부에서 문장들을 들여쓰기    
    => 필수는 아니지만 가독성을 위해 강력 권장!
<br>
<br>
<br>
<br>


---
## **변수란**
### **주석(comments)이란?**
**1) 주석(comments)이란** 
👉 일반문장과 달리 프로그램에 영향을 주지 않는 설명문
> 컴파일 과정의 대상이 아니기 때문에 프로그램 실행, 실행파일의 속도와 크기에 영향을 주지 않음

